---
kind: method
id: M:Autodesk.Revit.DB.FamilyTypeSet.ReverseIterator
source: html/39c6ba67-1469-a905-ae18-aaaa1bc615ea.htm
---
# Autodesk.Revit.DB.FamilyTypeSet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual FamilyTypeSetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.